Revit 2024 API
FormatOptions.IsValidSymbol Method (ForgeTypeId, ForgeTypeId)
 Checks whether a symbol is valid for a given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsValidSymbol(
	ForgeTypeId unitTypeId,
	ForgeTypeId symbolTypeId
)
Visual Basic
Public Shared Function IsValidSymbol ( _
	unitTypeId As ForgeTypeId, _
	symbolTypeId As ForgeTypeId _
) As Boolean
Visual C++
public:
static bool IsValidSymbol(
	ForgeTypeId^ unitTypeId,
	ForgeTypeId^ symbolTypeId
)
Parameters
unitTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the unit.
symbolTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the symbol to check.
Return Value
 True if the symbol is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FormatOptions Class
IsValidSymbol Overload
Autodesk.Revit.DB Namespace